[
  {
    "id": "workday:JR100596",
    "company": {
      "id": "immatics",
      "name": "Immatics",
      "careersUrl": "https://immatics.wd3.myworkdayjobs.com/Immatics_External"
    },
    "title": "(Senior) Clinical Statistical Programmer – SAS*",
    "location": "3 Locations",
    "workplace": null,
    "employmentType": null,
    "department": "",
    "team": null,
    "url": "https://immatics.wd3.myworkdayjobs.com/wday/cxs/immatics/Immatics_External/job/Remote-Work-Germany/XMLNAME--Senior--Clinical-Statistical-Programmer---SAS-_JR100596-1",
    "applyUrl": "https://immatics.wd3.myworkdayjobs.com/wday/cxs/immatics/Immatics_External/job/Remote-Work-Germany/XMLNAME--Senior--Clinical-Statistical-Programmer---SAS-_JR100596-1",
    "description": {
      "text": "ABOUT US Immatics is committed to making a meaningful impact on the lives of patients with cancer. We are the global leader in precision targeting of PRAME, a target expressed in more than 50 cancers. Our cutting-edge science and robust clinical pipeline form the broadest PRAME franchise with the most PRAME indications and modalities, spanning TCR T-cell therapies and TCR bispecifics. OVERVIEW We are currently seeking a full-time (Senior) Clinical Statistical Programmer – SAS* to join our Biostatistics Team in the Translational Science Department located in Tübingen, Germany. The position is available immediately and can be based in Tübingen, in Munich or remote (Germany). In this role, you will work in an interdisciplinary environment, collaborating closely with clinical departments across our global organization and will contribute to our mission of delivering novel PRAME immunotherapies to patients with cancer. This is a permanent position. YOUR MISSION Your main responsibilities will include but are not limited to the following tasks: Data Preparation, Standardization, and Statistical Output Generation Collaborate with biostatisticians to develop, validate, and review Table, Figures and Listings (TFLs) for our clinical studies. Work closely with biostatisticians and data managers to clarify data specifications and address data quality issues. Ensure together with biostatisticians the timely and accurate delivery of statistical outputs in alignment with protocol requirements and project timelines. Support the programming implementation of Statistical Analysis Plans, including mock TFLs and derived datasets. Support the development, review and validation of CDISC compliant SDTM and ADaM datasets. Quality, Compliance, and Regulatory Submission Participate in documentation, TMF filing, and compliance activities in accordance with Good Clinical Practice (GCP), ICH guidelines, and internal SOPs. Contribute to the preparation and quality control of statistical outputs, regulatory submission packages, and Clinical Study Reports, ensuring full traceability, consistency, and compliance with applicable standards. Process Optimization and Quality Assurance Contribute to the continuous improvement of data analysis workflows by identifying opportunities for greater efficiency and standardization. Develop and apply robust quality control measures to ensure the integrity, reproducibility, and regulatory compliance of all statistical programming outputs, in close collaboration with cross-functional clinical teams. YOUR PROFILE Bachelor’s or Master’s degree in statistics, data science, life sciences, or a related field, ideally with a focus on statistical programming. Strong proficiency in SAS in a clinical research setting is required, with experience in R considered a plus. A solid understanding of best programming practices is essential. Minimum 3-5 years of industry experience as a statistical programmer. Familiarity with applicable clinical research regulations such as GCP and ICH guidelines is preferred. Strong attention to detail and a highly structured, methodical working style. Ability to work independently, apply analytical thinking, and communicate clearly and effectively in English, German language skills are a plus. Basic knowledge of immunology, oncology, and/ or cell and gene therapy is a plus. WHY US? We are the global leader in precision targeting of PRAME. Driven by our mission to make an impact on the lives of patients with cancer, we are a committed and inspired team and cherish the collegial, highly motivated, and family-friendly atmosphere within Immatics. Our culture allows for a high level of originality, independent thinking, and initiative. We believe in supporting our employees’ professional and social skills: We enable them to join conferences and trainings as well as to enjoy our Immatics benefits – e.g., job bike, job ticket, Health Programs, childcare benefits, relocation allowance, Company summer and winter events. NOTICE *We value diversity and inclusion. Immatics N.V. and all Immatics subsidiaries are equal opportunity employers that evaluate qualified applicants without regard to race, color, national origin, religion, sex, age, marital status, disability, veteran status, sexual orientation, gender identity, or other characteristics protected by law.",
      "html": null
    },
    "source": {
      "kind": "workday_api",
      "raw": {
        "externalPath": "/job/Remote-Work-Germany/XMLNAME--Senior--Clinical-Statistical-Programmer---SAS-_JR100596-1"
      }
    },
    "postedAt": null,
    "scrapedAt": "2026-02-06T23:22:16.796Z"
  },
  {
    "id": "workday:JR100609",
    "company": {
      "id": "immatics",
      "name": "Immatics",
      "careersUrl": "https://immatics.wd3.myworkdayjobs.com/Immatics_External"
    },
    "title": "(Senior) Manager Clinical Sciences",
    "location": "3 Locations",
    "workplace": null,
    "employmentType": null,
    "department": "",
    "team": null,
    "url": "https://immatics.wd3.myworkdayjobs.com/wday/cxs/immatics/Immatics_External/job/Munich/XMLNAME--Senior--Manager-Clinical-Sciences_JR100609",
    "applyUrl": "https://immatics.wd3.myworkdayjobs.com/wday/cxs/immatics/Immatics_External/job/Munich/XMLNAME--Senior--Manager-Clinical-Sciences_JR100609",
    "description": {
      "text": "Immatics combines the discovery of true targets for cancer immunotherapies with the development of the right T cell receptors with the goal of enabling a robust and specific T cell response against these targets. This deep know-how is the foundation for our pipeline of Adoptive Cell Therapies and TCR Bispecifics as well as our partnerships with global leaders in the pharmaceutical industry. We are committed to delivering the power of T cells and to unlocking new avenues for patients in their fight against cancer. OVERVIEW We are currently seeking a (Senior) Manager Clinical Sciences* to strengthen our Clinical Sciences department. You will work in Tübingen, Munich or remote (Germany) in an interdisciplinary environment with colleagues from Germany and the US and will contribute to our mission of delivering novel PRAME immunotherapies to patients with cancer. This position is a fixed-term role of approximately 18-24 months as it covers a maternity leave. YOUR MISSION Your main responsibilities will include but are not limited to the following tasks: Acquire and utilize knowledge of clinical trial design to develop Clinical Trial Protocols and specific Trial Concept Sheets. Participate in discussions concerning scientific and procedural aspects of trial design. In collaboration with Medical Writing, Clinical Development, Clinical Operations, Clinical Data Management, Biostatisticians and other stakeholders prepare specific sections of Clinical Trial Protocols, Trial Manuals, Investigator Meeting Materials and other documents, as needed. Development of Patient Facing Material like Patient Information Sheets and Informed Consent Forms. Contribute to the design and development of Electronic Data Capture databases. Address Clinical Trial Protocol related questions from stakeholders and investigators with Medical Doctor supervision. Perform Patient Profile review with Medical Doctor supervision. Contribute to the design, preparation and/ or review of data listings, summary tables, Clinical Trial Reports, manuscripts, and scientific presentations or similar. Assist in the preparation and review of regulatory documents. Summarize and interpret scientific information available in published literature. YOUR PROFILE You hold a university degree in Biology, Clinical or Life Sciences, or a related field, and have gained at least 2 years of professional experience in the conduct of Clinical Trials within the healthcare or life sciences industry. Solid knowledge of GCP guidelines and a deep understanding of Clinical Development processes are essential. Experience with early-/ late-phase or pivotal oncological trials is required. Your motivation stems from a strong interest in oncology clinical research and patient safety, with the ambition to make a meaningful difference for patients with cancer. We are looking for a team player with excellent collaboration skills and the ability to inspire colleagues. Outstanding communication skills in English are required; German is an advantage. You approach changing requirements with openness and creativity, think outside the box, and demonstrate a high level of flexibility in an environment driven by a constant pursuit of excellence. A structured and reliable working style, combined with strong analytical thinking, completes your profile. WHY US? We are the global leader in precision targeting of PRAME. Driven by our mission to make an impact on the lives of patients with cancer, we are a committed and inspired team and cherish the collegial, highly motivated, and family-friendly atmosphere within Immatics. Our culture allows for a high level of originality, independent thinking, and initiative. We believe in supporting our employees’ professional and social skills: We enable them to join conferences and trainings as well as to enjoy our Immatics benefits – e.g., job bike, job ticket, Health Programs, childcare benefits, relocation allowance, Company summer and winter events. NOTICE *We value diversity and inclusion. Immatics N.V. and all Immatics subsidiaries are equal opportunity employers that evaluate qualified applicants without regard to race, color, national origin, religion, sex, age, marital status, disability, veteran status, sexual orientation, gender identity, or other characteristics protected by law.",
      "html": null
    },
    "source": {
      "kind": "workday_api",
      "raw": {
        "externalPath": "/job/Munich/XMLNAME--Senior--Manager-Clinical-Sciences_JR100609"
      }
    },
    "postedAt": null,
    "scrapedAt": "2026-02-06T23:22:16.796Z"
  },
  {
    "id": "workday:JR100553",
    "company": {
      "id": "immatics",
      "name": "Immatics",
      "careersUrl": "https://immatics.wd3.myworkdayjobs.com/Immatics_External"
    },
    "title": "Director Clinical Sciences/ Clinical Development*",
    "location": "3 Locations",
    "workplace": null,
    "employmentType": null,
    "department": "",
    "team": null,
    "url": "https://immatics.wd3.myworkdayjobs.com/wday/cxs/immatics/Immatics_External/job/Tuebingen-Germany/Director-Clinical-Sciences_JR100553",
    "applyUrl": "https://immatics.wd3.myworkdayjobs.com/wday/cxs/immatics/Immatics_External/job/Tuebingen-Germany/Director-Clinical-Sciences_JR100553",
    "description": {
      "text": "ABOUT US Immatics is committed to making a meaningful impact on the lives of patients with cancer. We are the global leader in precision targeting of PRAME, a target expressed in more than 50 cancers. Our cutting-edge science and robust clinical pipeline form the broadest PRAME franchise with the most PRAME indications and modalities, spanning TCR T-cell therapies and TCR bispecifics. OVERVIEW We are currently seeking a full- or part-time (min. 35 hrs/ week) Director Clinical Sciences/ Clinical Development* to strengthen our Clinical Sciences department. You will either work in one of our office locations in Tübingen or Munich, or remote (Germany) in an interdisciplinary environment with colleagues from Germany and the US and will contribute to our mission of delivering novel PRAME immunotherapies to patients with cancer. This role will be responsible for overseeing key aspects of clinical trial design and documentation, collaborating closely with interdisciplinary teams to ensure the successful clinical development of investigational medicinal products (IMPs). It reports directly to the Vice President of Clinical Sciences. YOUR MISSION Your main responsibilities will include but are not limited to the following tasks: Drive the clinical development (phase 1 to 3) of cancer immunotherapies in various solid tumor indications currently focused on two bi-specific molecules targeting two different tumor targets. Lead and oversee (Senior) Managers Clinical Sciences (direct reports). Provide strategic input into advisory boards and KOL interactions, ensuring stakeholder alignment on clinical aspects including target medicine profile, tumor indication and trial design. Lead cross-functional teams for preparation of regulatory (IND and CTA) submissions and subsequent submissions of amendments, addressing clinical/ scientific and procedural topics and integrating preclinical data, biomarkers, and competitive intelligence into trial designs. Author and manage the development of clinical trial synopsis/ protocols (CTPs) and related amendments, clinical trial reports (CTRs), patient information sheets and informed consent forms (PIS-ICFs), and other patient-facing materials in alignment with cross-functional teams. Prepare and review clinical sections of briefing books for US (FDA) and Europe (e.g., PEI in Germany). Ensure prompt responses on clinical aspects to regulatory and ethical review bodies. Prepare and review clinical sections of, e.g., investigator brochures (IB), and development and safety update reports (DSURs). Conduct trainings (e.g., CTP) to clinical sites, internal teams, and external partners, ensuring CTP accuracy. Establish functional plans and oversee the development, maintenance, and compliance of controlled documents (e.g., SOPs and Working Instructions) within Clinical Sciences. Manage internal and external stakeholders, organize data review meetings to analyze clinical trial data. Provide technical or subject matter expertise in clinical research programs. YOUR PROFILE Master’s degree or PhD (preferred) in Biology, Clinical Sciences, or Life Sciences. Minimum of 7 years’ experience in clinical trial conduct, with comprehensive knowledge of Good Clinical Practice (GCP) and a strong understanding of clinical development processes. Proven ability to lead cross-functional teams and ensure accurate clinical documentation within a regulated environment. Experience in the development of therapies for oncological indications is strongly preferred. Excellent verbal and written communication skills in both English and German. Ability to work independently while collaborating effectively in an interdisciplinary setting. Demonstrated flexibility and adaptability in dynamic and evolving environments. Proactive mindset combined with a structured and methodical approach to work. WHY US? We are the global leader in precision targeting of PRAME. Driven by our mission to make an impact on the lives of patients with cancer, we are a committed and inspired team and cherish the collegial, highly motivated, and family-friendly atmosphere within Immatics. Our culture allows for a high level of originality, independent thinking, and initiative. We believe in supporting our employees’ professional and social skills: We enable them to join conferences and trainings as well as to enjoy our Immatics benefits – e.g., job bike, job ticket, Health Programs, childcare benefits, relocation allowance, Company summer and winter events. NOTICE *We value diversity and inclusion. Immatics N.V. and all Immatics subsidiaries are equal opportunity employers that evaluate qualified applicants without regard to race, color, national origin, religion, sex, age, marital status, disability, veteran status, sexual orientation, gender identity, or other characteristics protected by law.",
      "html": null
    },
    "source": {
      "kind": "workday_api",
      "raw": {
        "externalPath": "/job/Tuebingen-Germany/Director-Clinical-Sciences_JR100553"
      }
    },
    "postedAt": null,
    "scrapedAt": "2026-02-06T23:22:16.796Z"
  },
  {
    "id": "workday:JR100587",
    "company": {
      "id": "immatics",
      "name": "Immatics",
      "careersUrl": "https://immatics.wd3.myworkdayjobs.com/Immatics_External"
    },
    "title": "Medical Monitor*",
    "location": "3 Locations",
    "workplace": null,
    "employmentType": null,
    "department": "",
    "team": null,
    "url": "https://immatics.wd3.myworkdayjobs.com/wday/cxs/immatics/Immatics_External/job/Tuebingen-Germany/Medical-Monitor-_JR100587",
    "applyUrl": "https://immatics.wd3.myworkdayjobs.com/wday/cxs/immatics/Immatics_External/job/Tuebingen-Germany/Medical-Monitor-_JR100587",
    "description": {
      "text": "ABOUT US Immatics is committed to making a meaningful impact on the lives of patients with cancer. We are the global leader in precision targeting of PRAME, a target expressed in more than 50 cancers. Our cutting-edge science and robust clinical pipeline form the broadest PRAME franchise with the most PRAME indications and modalities, spanning TCR T-cell therapies and TCR bispecifics. OVERVIEW We are currently seeking full-time or part time (at least 32 hours per week) a Medical Monitor* to strengthen our Clinical Development department. You will work in Tübingen, Munich or remote (Germany) in an interdisciplinary environment with colleagues from Germany and the US. Your analytical reasoning and action-oriented style as well as your organization and communication skills will contribute to the team’s success. In this role, you will collaborate closely with clinical departments across our global organization and will contribute to our mission of delivering novel PRAME immunotherapies to patients with cancer. YOUR MISSION Your main responsibilities will include but are not limited to the following tasks: Medical and Safety Oversight Provide medical oversight for clinical trials from Phase 1 to Phase 3 In collaboration with Drug Safety, assess (Serious) Adverse Events with regards to causality, expectedness and clinical management - including CIOMS and MedWatch forms Serve as primary contact for medical investigator enquiries Reviews MPs and other documents related to safety data review Lead/ support medical data review meetings, DSMB meeting and other meetings related to patient safety Collaborate with Drug Safety on signal detection Trial conduct and Protocol Compliance Provide medical input on trial design and clinical trial protocol development/ amendments Review and approve eCRFs Provide input for Investigator Brochures Ensure eligibility criteria, IMP dosing and management of adverse events, and safety assessments are in line with the clinical trial protocol Participate in Protocol Deviation assessments Support investigators by addressing protocol-related questions Participate in site selection and trainings (e.g., SIVs) Contribute to Investigator Meetings and all types of site visits as needed Regulatory Support regulatory filings and responses to regulatory enquiries Provide medical expertise for Risk Management Plans Data review, analysis and interpretation Ensure timely medical review of individual and aggregate safety and efficacy data Review patient narratives Contribute to interpretation of data in early clinical trials Contribute to clinical study reports, publications and presentations YOUR PROFILE You hold a medical doctor degree . Prior Experience as a Medical Monitor is required. Experience in oncology and in cell therapy, including clinical development or trial oversight is preferred. We expect a high degree of independent working, attention to detail and problem solving skills. You bring very good communication skills in English; German is a plus. Travel up to 30 % might be required. WHY US? We are the global leader in precision targeting of PRAME. Driven by our mission to make an impact on the lives of patients with cancer, we are a committed and inspired team and cherish the collegial, highly motivated, and family-friendly atmosphere within Immatics. Our culture allows for a high level of originality, independent thinking, and initiative. We believe in supporting our employees’ professional and social skills: We enable them to join conferences and trainings as well as to enjoy our Immatics benefits – e.g., job bike, job ticket, Health Programs, childcare benefits, relocation allowance, Company summer and winter events. NOTICE *We value diversity and inclusion. Immatics N.V. and all Immatics subsidiaries are equal opportunity employers that evaluate qualified applicants without regard to race, color, national origin, religion, sex, age, marital status, disability, veteran status, sexual orientation, gender identity, or other characteristics protected by law.",
      "html": null
    },
    "source": {
      "kind": "workday_api",
      "raw": {
        "externalPath": "/job/Tuebingen-Germany/Medical-Monitor-_JR100587"
      }
    },
    "postedAt": null,
    "scrapedAt": "2026-02-06T23:22:16.796Z"
  },
  {
    "id": "workday:JR100525",
    "company": {
      "id": "immatics",
      "name": "Immatics",
      "careersUrl": "https://immatics.wd3.myworkdayjobs.com/Immatics_External"
    },
    "title": "Senior Manager Clinical QA - Auditing Focus*",
    "location": "3 Locations",
    "workplace": null,
    "employmentType": null,
    "department": "",
    "team": null,
    "url": "https://immatics.wd3.myworkdayjobs.com/wday/cxs/immatics/Immatics_External/job/Tuebingen-Germany/Senior-Manager-Clinical-Quality-Assurance-_JR100525-1",
    "applyUrl": "https://immatics.wd3.myworkdayjobs.com/wday/cxs/immatics/Immatics_External/job/Tuebingen-Germany/Senior-Manager-Clinical-Quality-Assurance-_JR100525-1",
    "description": {
      "text": "ABOUT US Immatics is committed to making a meaningful impact on the lives of patients with cancer. We are the global leader in precision targeting of PRAME, a target expressed in more than 50 cancers. Our cutting-edge science and robust clinical pipeline form the broadest PRAME franchise with the most PRAME indications and modalities, spanning TCR T-cell therapies and TCR bispecifics. OVERVIEW We are currently seeking an experienced full- or part-time (mind. 32 hrs/ week) Senior Manager Clinical QA - Auditing Focus* to strengthen our Clinical Quality Assurance (CQA) department. You will either work in one of our office locations in Tübingen or Munich, or remote (Germany) in an interdisciplinary environment with colleagues from Germany and the US and will contribute to our mission of delivering novel PRAME immunotherapies to patients with cancer. YOUR MISSION Your main responsibilities will include but are not limited to the following tasks: Conduct of internal and external audits (investigator site audits and vendor audits) Creation or review and approval of quality related documents, including, e.g., QMS SOPs, working instructions, and respective quality documentation related to clinical trial management activities Support of the implementation and the maintenance of inspection readiness concepts and the preparation, hosting, and follow up of regulatory inspections Organization and conduct of quality related trainings to colleagues Provision of quality guidance and support to clinical functions for, e.g., protocol and process deviation management, change controls, root cause analyses, CAPA definitions for deviations/ audits and inspection observations as well as support for the related (e)QMS deliverables Support of the maintenance of the clinical (e)QMS including the definition, generation, and interpretation of quality metrics and trending reporting Support of the vendor selection, qualification and outsourcing management process YOUR PROFILE You hold a University degree in natural sciences or a related field and have gained 5&#43; years of experience in working for life sciences companies in a clinical quality management/ assurance function. Experience in general audit execution and, specifically, investigator site auditing is required. A background in quality management within a clinical trial environment and strong knowledge of ICH-GCP/ GCLP regulatory requirements are expected. Operational clinical trial management experience is considered an advantage. You are comfortable working in a global and matrixed business environment. Excellent interdisciplinary and intercultural communication skills in English and preferably German complete your profile. We expect a high degree of initiative, analytical reasoning and strong problem solving skills. You approach tasks in a structured, reliable and foresighted manner, combined with an elevated level of individual responsibility, enthusiasm and strong social skills. WHY US? We are the global leader in precision targeting of PRAME. Driven by our mission to make an impact on the lives of patients with cancer, we are a committed and inspired team and cherish the collegial, highly motivated, and family-friendly atmosphere within Immatics. Our culture allows for a high level of originality, independent thinking, and initiative. We believe in supporting our employees’ professional and social skills: We enable them to join conferences and trainings as well as to enjoy our Immatics benefits – e.g., job bike, job ticket, Health Programs, childcare benefits, relocation allowance, Company summer and winter events. NOTICE *We value diversity and inclusion. Immatics N.V. and all Immatics subsidiaries are equal opportunity employers that evaluate qualified applicants without regard to race, color, national origin, religion, sex, age, marital status, disability, veteran status, sexual orientation, gender identity, or other characteristics protected by law.",
      "html": null
    },
    "source": {
      "kind": "workday_api",
      "raw": {
        "externalPath": "/job/Tuebingen-Germany/Senior-Manager-Clinical-Quality-Assurance-_JR100525-1"
      }
    },
    "postedAt": null,
    "scrapedAt": "2026-02-06T23:22:16.796Z"
  }
]